<template>
  <div>
    <div class="audio_play">
      <!-- 使用key可以强制刷新组件 -->
      <aplayer :music="musicList" autoplay showLrc float theme="pic" preload="auto" :key="count">
      </aplayer>
    </div>
  </div>
</template>

<script>
  import aplayer from "vue-aplayer";
  export default {
    components: {
      //引入组件
      aplayer
    },
    data() {
      return {
        musicList: {
          title: '情非得已 (童声版)',
          artist: '群星',
          src: 'http://m7.music.126.net/20200529192421/f15f0dbd44c4cee53914c317fbd1bba6/ymusic/0fd6/4f65/43ed/a8772889f38dfcb91c04da915b301617.mp3',
          pic: 'https://p1.music.126.net/ZDUo6vF_5ykD6E_08HE1kw==/3385396303317256.jpg',
          lrc: '[00:04.050] [00:12.570]难以忘记初次见你 [00:16.860]一双迷人的眼睛 [00:21.460]在我脑海里 [00:23.960]你的身影 挥散不去 [00:30.160]握你的双手感觉你的温柔 [00:34.940]真的有点透不过气 [00:39.680]你的天真 我想珍惜 [00:43.880]看到你受委屈 我会伤心 [00:48.180]喔 [00:50.340]只怕我自己会爱上你 [00:55.070]不敢让自己靠的太近 [00:59.550]怕我没什么能够给你 [01:04.030]爱你也需要很大的勇气 [01:08.190]只怕我自己会爱上你 [01:12.910]也许有天会情不自禁 [01:17.380]想念只让自己苦了自己 [01:21.840]爱上你是我情非得已 [01:28.810]难以忘记初次见你 [01:33.170]一双迷人的眼睛 [01:37.700]在我脑海里 你的身影 挥散不去 [01:46.360]握你的双手感觉你的温柔 [01:51.120]真的有点透不过气 [01:55.910]你的天真 我想珍惜 [02:00.150]看到你受委屈 我会伤心 [02:04.490]喔 [02:06.540]只怕我自己会爱上你 [02:11.240]不敢让自己靠的太近 [02:15.750]怕我没什么能够给你 [02:20.200]爱你也需要很大的勇气 [02:24.570]只怕我自己会爱上你 [02:29.230]也许有天会情不自禁 [02:33.680]想念只让自己苦了自己 [02:38.140]爱上你是我情非得已 [03:04.060]什么原因 耶 [03:07.730]我竟然又会遇见你 [03:13.020]我真的真的不愿意 [03:16.630]就这样陷入爱的陷阱 [03:20.700]喔 [03:22.910]只怕我自己会爱上你 [03:27.570]不敢让自己靠的太近 [03:32.040]怕我没什么能够给你 [03:36.560]爱你也需要很大的勇气 [03:40.740]只怕我自己会爱上你 [03:45.460]也许有天会情不自禁 [03:49.990]想念只让自己苦了自己 [03:54.510]爱上你是我情非得已 [03:58.970]爱上你是我情非得已 [04:03.000] '
        },
        count:1
      };
    },
    computed: {
      getsongname() {
        return this.$store.getters.getsongname;
      },
      getsinger() {
        return this.$store.getters.getsinger;
      },
      getsongurl() {
        return this.$store.getters.getsongurl;
      },
      getpicurl() {
        return this.$store.getters.getpicurl;
      },
      getlrc() {
        return this.$store.getters.getlrc;
      }
    },
    created(){
      this.musicList ={
        title: '情非得已 (童声版)',
          artist: '群星',
          src: 'http://m7.music.126.net/20200529192421/f15f0dbd44c4cee53914c317fbd1bba6/ymusic/0fd6/4f65/43ed/a8772889f38dfcb91c04da915b301617.mp3',
          pic: 'https://p1.music.126.net/ZDUo6vF_5ykD6E_08HE1kw==/3385396303317256.jpg',
          lrc: '[00:04.050] [00:12.570]难以忘记初次见你 [00:16.860]一双迷人的眼睛 [00:21.460]在我脑海里 [00:23.960]你的身影 挥散不去 [00:30.160]握你的双手感觉你的温柔 [00:34.940]真的有点透不过气 [00:39.680]你的天真 我想珍惜 [00:43.880]看到你受委屈 我会伤心 [00:48.180]喔 [00:50.340]只怕我自己会爱上你 [00:55.070]不敢让自己靠的太近 [00:59.550]怕我没什么能够给你 [01:04.030]爱你也需要很大的勇气 [01:08.190]只怕我自己会爱上你 [01:12.910]也许有天会情不自禁 [01:17.380]想念只让自己苦了自己 [01:21.840]爱上你是我情非得已 [01:28.810]难以忘记初次见你 [01:33.170]一双迷人的眼睛 [01:37.700]在我脑海里 你的身影 挥散不去 [01:46.360]握你的双手感觉你的温柔 [01:51.120]真的有点透不过气 [01:55.910]你的天真 我想珍惜 [02:00.150]看到你受委屈 我会伤心 [02:04.490]喔 [02:06.540]只怕我自己会爱上你 [02:11.240]不敢让自己靠的太近 [02:15.750]怕我没什么能够给你 [02:20.200]爱你也需要很大的勇气 [02:24.570]只怕我自己会爱上你 [02:29.230]也许有天会情不自禁 [02:33.680]想念只让自己苦了自己 [02:38.140]爱上你是我情非得已 [03:04.060]什么原因 耶 [03:07.730]我竟然又会遇见你 [03:13.020]我真的真的不愿意 [03:16.630]就这样陷入爱的陷阱 [03:20.700]喔 [03:22.910]只怕我自己会爱上你 [03:27.570]不敢让自己靠的太近 [03:32.040]怕我没什么能够给你 [03:36.560]爱你也需要很大的勇气 [03:40.740]只怕我自己会爱上你 [03:45.460]也许有天会情不自禁 [03:49.990]想念只让自己苦了自己 [03:54.510]爱上你是我情非得已 [03:58.970]爱上你是我情非得已 [04:03.000] '
        
      }
    },
    methods:{

    },
    watch:{
      getsongname:{
        handler(newName, oldName) {
          // 使用key可以强制刷新组件 
          this.count++
          this.musicList.title = this.getsongname
          this.musicList.artist = this.getsinger
          this.musicList.src = this.getsongurl
          this.musicList.pic = this.getpicurl
          this.musicList.lrc = this.getlrc
          console.log(this.musicList);
        },
        deep: true,
        immediate: true
      }
    }
    
  }
</script>

<style lang="scss" scoped>
.audio_play{
  width: 1340px;
  margin-left: 20px; 

}

</style>
